In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("homeprices.csv")

In [3]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [4]:
import math                                                        ####we can clearly see improper data 
mid_bed=math.floor(df.bedrooms.median())                           ####Let's preprocess data 
mid_bed

4

In [7]:
df.bedrooms=df.bedrooms.fillna(mid_bed)    #### Data cleaning done

In [8]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

Now observe the data above, we can see the relation between area, bedroom, age with price

Area -> Price <br>
Bedrooms -> Price <br>
Age -> 1/Price

Features are directly or inversely proportional to the final price<br>
Therefore we will use Linear Regression to predict the price.

## Linear Regression

In [9]:
from sklearn import linear_model

In [11]:
reg=linear_model.LinearRegression()
reg.fit(df[['area','bedrooms','age']],df.price)

LinearRegression()

y= m1 * area + m2 * bedrooms + m3 * age + c

In [12]:
reg.coef_  ##Value of m1, m2, m3

array([  112.06244194, 23388.88007794, -3231.71790863])

In [13]:
reg.intercept_  ##Value of c

221323.00186540443

Now our model is ready<br>
let's predict some values for area=3000 bedrooms=2 age=2

In [14]:
reg.predict([[3000,2,2]])

array([597824.65203042])

In [15]:
##let's check it
print(3000*112.06244194 + 23388.88007794*2 - 3231.71790863*2 + 221323.00186540443)

597824.6520240244